bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA2561.xml
            <value-group caption="" name="ANALOG_ADC_PRESCALER">
                <value caption="2" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Bootloader" name="BOOT_LOAD">
            <register-group caption="Bootloader" name="BOOT_LOAD">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="TQFP64" caption="TQFP64">
            <pin position="1" pad="PG5"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="RESET"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
        <pinout name="QFN64" caption="QFN64">
            <pin position="1" pad="PG5"/>
            <pin position="2" pad="PE0"/>
            <pin position="3" pad="PE1"/>
            <pin position="4" pad="PE2"/>
            <pin position="5" pad="PE3"/>
            <pin position="6" pad="PE4"/>
            <pin position="7" pad="PE5"/>
            <pin position="8" pad="PE6"/>
            <pin position="9" pad="PE7"/>
            <pin position="10" pad="PB0"/>
            <pin position="11" pad="PB1"/>
            <pin position="12" pad="PB2"/>
            <pin position="13" pad="PB3"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="PB5"/>
            <pin position="16" pad="PB6"/>
            <pin position="17" pad="PB7"/>
            <pin position="18" pad="PG3"/>
            <pin position="19" pad="PG4"/>
            <pin position="20" pad="RESET"/>
            <pin position="21" pad="VCC"/>
            <pin position="22" pad="GND"/>
            <pin position="23" pad="XTAL2"/>
            <pin position="24" pad="XTAL1"/>
            <pin position="25" pad="PD0"/>
            <pin position="26" pad="PD1"/>
            <pin position="27" pad="PD2"/>
            <pin position="28" pad="PD3"/>
            <pin position="29" pad="PD4"/>
            <pin position="30" pad="PD5"/>
            <pin position="31" pad="PD6"/>
            <pin position="32" pad="PD7"/>
            <pin position="33" pad="PG0"/>
            <pin position="34" pad="PG1"/>
            <pin position="35" pad="PC0"/>
            <pin position="36" pad="PC1"/>
            <pin position="37" pad="PC2"/>
            <pin position="38" pad="PC3"/>
            <pin position="39" pad="PC4"/>
            <pin position="40" pad="PC5"/>
            <pin position="41" pad="PC6"/>
            <pin position="42" pad="PC7"/>
            <pin position="43" pad="PG2"/>
            <pin position="44" pad="PA7"/>
            <pin position="45" pad="PA6"/>
            <pin position="46" pad="PA5"/>
            <pin position="47" pad="PA4"/>
            <pin position="48" pad="PA3"/>
            <pin position="49" pad="PA2"/>
            <pin position="50" pad="PA1"/>
            <pin position="51" pad="PA0"/>
            <pin position="52" pad="VCC"/>
            <pin position="53" pad="GND"/>
            <pin position="54" pad="PF7"/>
            <pin position="55" pad="PF6"/>
            <pin position="56" pad="PF5"/>
            <pin position="57" pad="PF4"/>
            <pin position="58" pad="PF3"/>
            <pin position="59" pad="PF2"/>
            <pin position="60" pad="PF1"/>
            <pin position="61" pad="PF0"/>
            <pin position="62" pad="AREF"/>
            <pin position="63" pad="GND"/>
            <pin position="64" pad="AVCC"/>
        </pinout>
    </pinouts>
</target-description-file>
